#include <vector>

using namespace std;

int main() {
    //////////////////////////////////////////////
    
    vector<int> v; 
    // int형 벡터 생성

    //////////////////////////////////////////////

    vector<int>v(4); 
    // 크기가 4인 int형 벡터 생성 ( 0으로 초기화 )
    // 동적으로 할당되는 데이터를 크기로 지정하면 안됨

    //////////////////////////////////////////////

    vector<int>v = {1,2,3};

    //////////////////////////////////////////////

    vector<int>v[] = {{1,2}, {3,4}};

    //////////////////////////////////////////////

    vector<vector<int>> v; 
    // 2차원 벡터 생성 ( 단, 행과 열 모두 가변 )

    //////////////////////////////////////////////

    vector<int> v = {1,2,3,4,5};
    v.assign(5, 10); 
    // output : 10 10 10 10 10

    //////////////////////////////////////////////  

    vector<int> num = {1,1,2,3,4,4,4};
    sort(num.begin(), num.end());
    num.erase(unique(num.begin(), num.end()), num.end());
    // 중복값 제거
}